[{"id":"1","name":"Injen Performance Down-Pipe W/Cat","description":"Injen Technology has examined the stock down-pipe and found prominent potential on improving the OE design by using mandrel bent stainless steel for optimum flow and corrosion resistance. TIG-welded by hand for race proven durability and endurance and eliminating any possibility of cracking during heat cycles. All of the Injen downpipes are uniquely designed to increase exhaust velocity for improved horsepower and torque.","price":"642.95","image_url":"https://injen.com/images/M198652562.jpg"},{"id":"2","name":"Injen RD Cold Air Intake System","description":"Add some easy horsepower to your Ride with this RD Series Performance cold air intake (CAI) from Injen Technology! The engineers at Injen have spent considerable amounts of time designing, testing, and perfecting this CAI to produce some serious bolt-on power while also providing amazing engine bay aesthetics. In addition to the impressive power increase, the Injen team has ensured that safe Air fuel (A/F) ratios are maintained throughout the powerband.","price":"374.95","image_url":"https://injen.com/images/M198653034.jpg"},{"id":"3","name":"Injen Hydroshield","description":"Injen Technology's Hydroshield are designed to enhance the efficiency of any air filter, including Injen's SuperNano-Web and our 8-Layer oiled cotton gauze air filters. Injen's Hydroshield is constructed from a proprietary base media and then treated with a hydrophobic water-repellent. Our Hydroshield is UV resistant, can stop contaminants down to .005”, is puncture resistant, and has elasticity characteristics which helps the Hydroshield to return to the original shape/position after servicing. Injen's Hydroshields are engineered to divert damaging contaminants, which can clog your air filter and compromise peak air-flow and horsepower output. Injen's Hydroshield also extends the time between servicing intervals, reducing costs and improving the overall user experience.","price":"25.95","image_url":"https://injen.com/images/M198656822.jpg"},{"id":"4","name":"Subaru High Flow Fuel Pump","description":"AEM's 340lph E85-Compatible High Flow In-Tank Fuel Pumps feature robust internal construction that is designed to withstand the low lubricity characteristics of ethanol and methanol fuels, and are tested to work with ethanol fuels up to E100, methanol fuels up to M100 and all types of gasoline. Its compact, short body design (65mm length) with mounting hooks also makes it ideal in universal applications that have fuel tanks with tight tolerances. The 340lph E85-Compatible High Flow In-Tank fuel pump includes a wiring harness, pre filter and O-rings. Every AEM 340lph E85-Compatible Fuel Pump is tested to flow 340 lph at 40 PSI before it is packaged for sale.","price":"175.00","image_url":"https://www.cobbtuning.com/media/catalog/products/312450_main.jpg"},{"id":"4fa8e6e8-32a3-4f5d-b639-3f09a5c24ae4","name":"Max's Car Parts","description":"This is a test part","price":"24.97","image_url":"https://injen.com/images/M198656822.jpg"}]